<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ff4ada24cfa45bd3e2df689f4af31d6335e3752c4040acc4b817d4c9108e10b0","plan_job_ref":"Job Run Terraform plan in staging #178 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13286859744","plan_out_hash":"52f4aa4fe673e4bb991292ac0d105ac8563609f50202b11a0c3b1b87a411be4a","plan_hash":"eefe3a411da3854c43b5b08db71aaeac50687105827c700c325bc558ca75db8d","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "a68WZ4UM7kyITwyMLSH0lEo5d84cgO064hidD3tjcP4=" -> "pji4RApRwHZ2w1h8XWBreA8XLCDXu6bukiSWWI+CmlM="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-28T18:17:01Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "1d819ae858cd42078f02e263ffec500b9b3ce6b784fb33e072fbc783910ae498" -> "1939e872c16e717171e1068107fdc320d2c27e24caf6769f38af5c95f9a7f7be"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-24T14:03:42Z" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #178](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13286859744)